import React, { useState } from "react";

const Faq = () => {
  const [accordions, setAccordions] = useState([
    {
      id: 1,
      caption: "ВАЖНО! Требования к аккаунту",
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
    {
      id: 2,
      caption: "У меня новый или ранее не пополнявшийся аккаунт",
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
    {
      id: 3,
      caption: "Пришла сумма меньше чем в калькуляторе. Что делать?",
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
    {
      id: 5,
      caption: "Не приходят деньги на баланс аккаунта Steam",
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
    {
      id: 6,
      caption: "Я указал неверный логин",
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
    {
      id: 7,
      caption: 'Что такое "Логин"?',
      text: [
        " Если Вы совершаете первое пополнение аккаунта Steam, то валюта аккаунта может смениться на одну из списка ($, ₸, € и другие).",
        " В этом случае цены на внутренние товары Steam будут пересчитываться в валюту аккаунта ($, ₸, € и другие), а не ₽ (рубли). Учтите это при пополнении!",
      ],
      active: false,
    },
  ]);

  const toggleAccordion = (id) => {
    const newAccordions = accordions.map((acc) => {
      if (acc.id === id) return { ...acc, active: !acc.active };
      return acc;
    });
    setAccordions(newAccordions);
  };

  return (
    <section className="faq">
      <div className="wrapper faq__wrapper">
        <div className="cols">
          <div className="col">
            <h2 className="subheading faq__heading">Общие вопросы и ответы</h2>
            <p className="faq__text">
              Все, что вам нужно знать о пополнении и его работе. Не можете
              найти ответ?{" "}
              <a href="#" className="faq__text-link">
                Задать вопрос.
              </a>
            </p>
            <div className="faq__point-list">
              <div className="faq__point-item">
                <div className="faq__point-item-counter">1/4</div>
                <div className="faq__point-item-icon">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clip-path="url(#clip0_48_1435)">
                      <path
                        d="M15.9381 32C24.8088 32 32 24.8366 32 16C32 7.16344 24.8088 0 15.9381 0C7.93346 0 1.29646 5.83282 0.0766641 13.4645L11.7685 18.515C11.9558 18.3866 12.1555 18.2749 12.3687 18.1843C12.8522 17.9763 13.3621 17.8839 13.8702 17.907L17.0069 13.1538C17.0057 13.1326 17.0057 13.1102 17.0057 13.0878C17.0057 10.2823 19.1897 8 21.8749 8C24.5602 8 26.7435 10.2822 26.7435 13.0877C26.7435 15.8931 24.5602 18.1766 21.8749 18.1766C21.8381 18.1766 21.8012 18.176 21.7643 18.1747L17.276 21.5207C17.2895 22.0375 17.198 22.5556 17.0026 23.0486C16.2494 24.9373 14.1638 25.8361 12.3546 25.047C11.2487 24.5662 10.4993 23.566 10.2548 22.4272L0 17.997C0.986672 25.8911 7.74619 32 15.9381 32Z"
                        fill="#7B58E8"
                      />
                      <path
                        d="M12.6666 24.2645C14.0636 24.8718 15.6707 24.1791 16.2538 22.7206C16.5351 22.0157 16.5363 21.2357 16.2574 20.5282C15.9791 19.8207 15.4538 19.268 14.7769 18.974C14.1054 18.6825 13.3866 18.6915 12.7545 18.9418L14.3929 19.65C15.4226 20.0981 15.9097 21.3332 15.4803 22.4086C15.0521 23.4832 13.8702 23.993 12.8399 23.5449L11.2549 22.8592C11.5357 23.471 12.0222 23.9839 12.6666 24.2645Z"
                        fill="#7B58E8"
                      />
                      <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M18.6309 13.0877C18.6309 14.9571 20.0862 16.4786 21.8745 16.4786C23.6629 16.4786 25.1189 14.9571 25.1189 13.0877C25.1189 11.2195 23.6629 9.698 21.8745 9.698C20.0862 9.698 18.6309 11.2195 18.6309 13.0877ZM19.4437 13.0826C19.4437 14.4891 20.5347 15.6286 21.8795 15.6286C23.2255 15.6286 24.3172 14.4891 24.3172 13.0826C24.3172 11.676 23.2255 10.5352 21.8795 10.5352C20.5347 10.5352 19.4437 11.676 19.4437 13.0826Z"
                        fill="#7B58E8"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_48_1435">
                        <rect width="32" height="32" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </div>
                <h3 className="faq__point-item-heading">
                  Введите свой логин Steam
                </h3>
              </div>
              <div className="faq__point-item">
                <div className="faq__point-item-counter">2/4</div>
                <div className="faq__point-item-icon">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M18.0003 15H14.3337V10.9333C14.3337 10.804 14.3337 10.7271 14.3353 10.6691C14.3363 10.6322 14.3377 10.6162 14.3381 10.6124C14.3614 10.4715 14.4718 10.361 14.6127 10.3378C14.6166 10.3374 14.6326 10.336 14.6694 10.335C14.7274 10.3334 14.8044 10.3333 14.9337 10.3333H18.0003C19.289 10.3333 20.3337 11.378 20.3337 12.6667C20.3337 13.9553 19.289 15 18.0003 15Z"
                      fill="#7B58E8"
                    />
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M29.3337 16C29.3337 23.3638 23.3641 29.3333 16.0003 29.3333C8.63653 29.3333 2.66699 23.3638 2.66699 16C2.66699 8.63619 8.63653 2.66666 16.0003 2.66666C23.3641 2.66666 29.3337 8.63619 29.3337 16ZM11.0003 18.6667C11.0003 18.1144 11.448 17.6667 12.0003 17.6667H12.3337V17H12.0003C11.448 17 11.0003 16.5523 11.0003 16C11.0003 15.4477 11.448 15 12.0003 15H12.3337L12.3336 10.882C12.3334 10.688 12.3331 10.4863 12.3624 10.3016C12.5205 9.30323 13.3036 8.52018 14.302 8.36205C14.4866 8.33281 14.6883 8.33305 14.8823 8.33328L18.0003 8.33332C20.3936 8.33332 22.3337 10.2734 22.3337 12.6667C22.3337 15.0599 20.3936 17 18.0003 17H14.3337V17.6667H16.0003C16.5526 17.6667 17.0003 18.1144 17.0003 18.6667C17.0003 19.2189 16.5526 19.6667 16.0003 19.6667H14.3337V22.6667C14.3337 23.2189 13.8859 23.6667 13.3337 23.6667C12.7814 23.6667 12.3337 23.2189 12.3337 22.6667V19.6667H12.0003C11.448 19.6667 11.0003 19.2189 11.0003 18.6667Z"
                      fill="#7B58E8"
                    />
                  </svg>
                </div>
                <h3 className="faq__point-item-heading">
                  Укажите желаемую сумму пополнения
                </h3>
              </div>
              <div className="faq__point-item">
                <div className="faq__point-item-counter">3/4</div>
                <div className="faq__point-item-icon">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M27.2143 13.1475C27.1415 13.1428 27.0622 13.1429 26.98 13.1429L26.9595 13.1429H23.7357C21.0785 13.1429 18.8048 15.251 18.8048 18C18.8048 20.7491 21.0785 22.8572 23.7357 22.8572H26.9595L26.98 22.8572C27.0622 22.8572 27.1415 22.8572 27.2143 22.8526C28.2937 22.7839 29.2482 21.9326 29.3285 20.7436C29.3337 20.6657 29.3337 20.5816 29.3336 20.5037L29.3336 20.4826V15.5175L29.3336 15.4963C29.3337 15.4185 29.3337 15.3344 29.3285 15.2564C29.2482 14.0674 28.2937 13.2161 27.2143 13.1475ZM23.4499 19.2953C24.134 19.2953 24.6886 18.7154 24.6886 18C24.6886 17.2847 24.134 16.7048 23.4499 16.7048C22.7658 16.7048 22.2112 17.2847 22.2112 18C22.2112 18.7154 22.7658 19.2953 23.4499 19.2953Z"
                      fill="#7B58E8"
                    />
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M26.9792 24.8C27.1708 24.795 27.3158 24.9739 27.2638 25.1598C27.0058 26.0826 26.5964 26.8691 25.9393 27.5314C24.9775 28.5007 23.758 28.9308 22.2513 29.135C20.7872 29.3334 18.9165 29.3334 16.5548 29.3334H13.8395C11.4777 29.3334 9.607 29.3334 8.14295 29.135C6.63622 28.9308 5.41669 28.5007 4.45494 27.5314C3.49318 26.5621 3.06637 25.3329 2.86379 23.8144C2.66696 22.3388 2.66697 20.4534 2.66699 18.0731V17.9269C2.66697 15.5466 2.66696 13.6612 2.86379 12.1857C3.06637 10.6671 3.49318 9.43799 4.45494 8.46868C5.41669 7.49937 6.63622 7.0692 8.14295 6.86503C9.607 6.66665 11.4777 6.66667 13.8395 6.66669L16.5548 6.66669C18.9165 6.66667 20.7872 6.66665 22.2513 6.86503C23.758 7.0692 24.9775 7.49937 25.9393 8.46868C26.5964 9.13091 27.0058 9.9174 27.2638 10.8402C27.3158 11.0261 27.1708 11.205 26.9791 11.2L23.7356 11.2C20.0901 11.2 16.877 14.1025 16.877 18C16.877 21.8975 20.0901 24.8 23.7356 24.8L26.9792 24.8ZM7.48627 11.8476C6.95395 11.8476 6.52241 12.2826 6.52241 12.8191C6.52241 13.3556 6.95395 13.7905 7.48627 13.7905H12.6268C13.1592 13.7905 13.5907 13.3556 13.5907 12.8191C13.5907 12.2826 13.1592 11.8476 12.6268 11.8476H7.48627Z"
                      fill="#7B58E8"
                    />
                    <path
                      d="M10.3692 5.36587L12.981 3.4417C14.3836 2.40835 16.2837 2.40835 17.6863 3.4417L20.3118 5.37599C19.2141 5.33329 17.9882 5.33332 16.6441 5.33336H13.7501C12.522 5.33333 11.3925 5.3333 10.3692 5.36587Z"
                      fill="#7B58E8"
                    />
                  </svg>
                </div>
                <h3 className="faq__point-item-heading">
                  Оплати любым удобным методом
                </h3>
              </div>
              <div className="faq__point-item">
                <div className="faq__point-item-counter">4/4</div>
                <div className="faq__point-item-icon">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M4.05412 3.05651C3.5331 2.87333 2.96223 3.14721 2.77905 3.66823C2.59587 4.18925 2.86974 4.76012 3.39076 4.9433L3.73904 5.06575C4.62919 5.3787 5.21419 5.5861 5.64465 5.79731C6.04895 5.99569 6.22718 6.15627 6.34459 6.32808C6.46494 6.5042 6.55787 6.74609 6.61031 7.23056C6.66519 7.7375 6.66655 8.39779 6.66655 9.38438L6.66655 12.8533C6.66655 16.7754 6.75086 18.0698 7.90606 19.2882C9.06127 20.5066 10.9205 20.5066 14.6391 20.5066H21.7096C23.791 20.5066 24.8316 20.5066 25.5673 19.9072C26.3029 19.3077 26.513 18.2884 26.9331 16.2499L27.5995 13.017C28.0623 10.6982 28.2937 9.53885 27.7018 8.7694C27.1099 7.99996 25.0875 7.99996 22.8409 7.99996H8.65661C8.64769 7.63952 8.63077 7.3116 8.5987 7.01533C8.52706 6.35349 8.37184 5.74987 7.99586 5.19968C7.61695 4.6452 7.11316 4.29008 6.52565 4.00181C5.9762 3.73221 5.27802 3.48678 4.45598 3.1978L4.05412 3.05651ZM20.6898 11.2758C21.0897 11.6567 21.1052 12.2897 20.7243 12.6896L16.9148 16.6896C16.726 16.8878 16.4643 17 16.1906 17C15.917 17 15.6552 16.8878 15.4665 16.6896L13.9427 15.0896C13.5618 14.6897 13.5772 14.0567 13.9772 13.6758C14.3771 13.2949 15.0101 13.3104 15.391 13.7103L16.1906 14.55L19.276 11.3103C19.6569 10.9104 20.2899 10.8949 20.6898 11.2758Z"
                      fill="#7B58E8"
                    />
                    <path
                      d="M10.0002 24C11.1047 24 12.0002 24.8954 12.0002 26C12.0002 27.1045 11.1047 28 10.0002 28C8.89559 28 8.00016 27.1045 8.00016 26C8.00016 24.8954 8.89559 24 10.0002 24Z"
                      fill="#7B58E8"
                    />
                    <path
                      d="M22.0002 24.0001C23.1047 24.0001 24.0002 24.8955 24.0002 26.0001C24.0002 27.1046 23.1047 28.0001 22.0002 28.0001C20.8956 28.0001 20.0002 27.1046 20.0002 26.0001C20.0002 24.8955 20.8956 24.0001 22.0002 24.0001Z"
                      fill="#7B58E8"
                    />
                  </svg>
                </div>
                <h3 className="faq__point-item-heading">
                  Получи деньги на баланс Steam!
                </h3>
              </div>
            </div>
          </div>
          <div className="col">
            <div className="accordion">
              {accordions &&
                accordions.map((item) => (
                  <div
                    key={item.id}
                    className={
                      item.active
                        ? "accordion-item accordion-item--active"
                        : "accordion-item"
                    }
                    onClick={() => toggleAccordion(item.id)}
                  >
                    <div className="accordion-item__header">
                      <h3 className="accordion-item__heading">
                        {item.caption}
                      </h3>
                      <button
                        onClick={() => toggleAccordion(item.id)}
                        className="accordion-item__toggle-btn"
                      ></button>
                    </div>
                    <div className="accordion-item__content">
                      {item.text.map((t) => (
                        <p>{t}</p>
                      ))}
                    </div>
                  </div>
                ))}
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Faq;
